mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/common/s6e2dhxg.h
typedef struct stc_bt_rt_tmcr_field
{
    union {
        struct {
            __IO  uint16_t  STRG                 :1;
            __IO  uint16_t  CTEN                 :1;
            __IO  uint16_t  MDSE                 :1;
            __IO  uint16_t  OSEL                 :1;
            __IO  uint16_t  FMD                  :3;
            __IO  uint16_t  T32                  :1;
            __IO  uint16_t  EGS                  :2;
            __IO  uint16_t  RESERVED22           :2;
            __IO  uint16_t  CKS                  :3;
            __IO  uint16_t  RESERVED24           :1;
        };
        struct {
            __IO  uint16_t  RESERVED20           :4;
            __IO  uint16_t  FMD0                 :1;
            __IO  uint16_t  FMD1                 :1;
            __IO  uint16_t  FMD2                 :1;
            __IO  uint16_t  RESERVED21           :1;
            __IO  uint16_t  EGS0                 :1;
            __IO  uint16_t  EGS1                 :1;
            __IO  uint16_t  RESERVED23           :2;
            __IO  uint16_t  CKS0                 :1;
            __IO  uint16_t  CKS1                 :1;
            __IO  uint16_t  CKS2                 :1;
            __IO  uint16_t  RESERVED25           :1;
        };
    };
} stc_bt_rt_tmcr_field_t;

typedef struct stc_bt_ppg_stc_field
{
        __IO   uint8_t  UDIR                     :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  TGIR                     :1;
        __IO   uint8_t  RESERVED1                :1;
        __IO   uint8_t  UDIE                     :1;
        __IO   uint8_t  RESERVED2                :1;
        __IO   uint8_t  TGIE                     :1;
        __IO   uint8_t  RESERVED3                :1;
} stc_bt_ppg_stc_field_t;

typedef struct stc_bt_pwc_stc_field
{
        __IO   uint8_t  OVIR                     :1;
        __IO   uint8_t  RESERVED5                :1;
        __IO   uint8_t  EDIR                     :1;
        __IO   uint8_t  RESERVED6                :1;
        __IO   uint8_t  OVIE                     :1;
        __IO   uint8_t  RESERVED7                :1;
        __IO   uint8_t  EDIE                     :1;
        __IO   uint8_t  ERR                      :1;
} stc_bt_pwc_stc_field_t;

typedef struct stc_bt_pwm_stc_field
{
        __IO   uint8_t  UDIR                     :1;
        __IO   uint8_t  DTIR                     :1;
        __IO   uint8_t  TGIR                     :1;
        __IO   uint8_t  RESERVED9                :1;
        __IO   uint8_t  UDIE                     :1;
        __IO   uint8_t  DTIE                     :1;
        __IO   uint8_t  TGIE                     :1;
        __IO   uint8_t  RESERVED10               :1;
} stc_bt_pwm_stc_field_t;

typedef struct stc_bt_rt_stc_field
{
        __IO   uint8_t  UDIR                     :1;
        __IO   uint8_t  RESERVED12               :1;
        __IO   uint8_t  TGIR                     :1;
        __IO   uint8_t  RESERVED13               :1;
        __IO   uint8_t  UDIE                     :1;
        __IO   uint8_t  RESERVED14               :1;
        __IO   uint8_t  TGIE                     :1;
        __IO   uint8_t  RESERVED15               :1;
} stc_bt_rt_stc_field_t;

typedef struct stc_bt_ppg_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_bt_ppg_tmcr2_field_t;

typedef struct stc_bt_pwc_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED2                :7;
} stc_bt_pwc_tmcr2_field_t;

typedef struct stc_bt_pwm_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED4                :7;
} stc_bt_pwm_tmcr2_field_t;

typedef struct stc_bt_rt_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED6                :6;
        __IO   uint8_t  GATE                     :1;
} stc_bt_rt_tmcr2_field_t;

/*******************************************************************************
* BTIOSEL03_MODULE
*******************************************************************************/
typedef struct stc_btiosel03_btsel0123_field
{
    union {
        struct {
            __IO   uint8_t  SEL01                :4;
            __IO   uint8_t  SEL23                :4;
        };
        struct {
            __IO   uint8_t  SEL010               :1;
            __IO   uint8_t  SEL011               :1;
            __IO   uint8_t  SEL012               :1;
            __IO   uint8_t  SEL013               :1;
            __IO   uint8_t  SEL230               :1;
            __IO   uint8_t  SEL231               :1;
            __IO   uint8_t  SEL232               :1;
            __IO   uint8_t  SEL233               :1;
        };
    };
} stc_btiosel03_btsel0123_field_t;

/*******************************************************************************
* BTIOSEL47_MODULE
*******************************************************************************/
typedef struct stc_btiosel47_btsel4567_field
{
    union {
        struct {
            __IO   uint8_t  SEL45                :4;
            __IO   uint8_t  SEL67                :4;
        };
        struct {
            __IO   uint8_t  SEL450               :1;
            __IO   uint8_t  SEL451               :1;
            __IO   uint8_t  SEL452               :1;
            __IO   uint8_t  SEL453               :1;
            __IO   uint8_t  SEL670               :1;
            __IO   uint8_t  SEL671               :1;
            __IO   uint8_t  SEL672               :1;
            __IO   uint8_t  SEL673               :1;
        };
    };
} stc_btiosel47_btsel4567_field_t;

/*******************************************************************************
* CANFD_MODULE
*******************************************************************************/
typedef struct stc_canfd_crel_field
{
    union {
        struct {
            __IO  uint32_t  DAY                  :8;
            __IO  uint32_t  MON                  :8;
            __IO  uint32_t  YEAR                 :4;
            __IO  uint32_t  SUBSTEP              :4;
            __IO  uint32_t  STEP                 :4;
            __IO  uint32_t  REL                  :4;
        };
        struct {
            __IO  uint32_t  DAY0                 :1;
            __IO  uint32_t  DAY1                 :1;
            __IO  uint32_t  DAY2                 :1;
            __IO  uint32_t  DAY3                 :1;
            __IO  uint32_t  DAY4                 :1;
            __IO  uint32_t  DAY5                 :1;
            __IO  uint32_t  DAY6                 :1;
            __IO  uint32_t  DAY7                 :1;
            __IO  uint32_t  MON0                 :1;
            __IO  uint32_t  MON1                 :1;
            __IO  uint32_t  MON2                 :1;
            __IO  uint32_t  MON3                 :1;
            __IO  uint32_t  MON4                 :1;
            __IO  uint32_t  MON5                 :1;
            __IO  uint32_t  MON6                 :1;
            __IO  uint32_t  MON7                 :1;
            __IO  uint32_t  YEAR0                :1;
            __IO  uint32_t  YEAR1                :1;
            __IO  uint32_t  YEAR2                :1;
            __IO  uint32_t  YEAR3                :1;
            __IO  uint32_t  SUBSTEP0             :1;
            __IO  uint32_t  SUBSTEP1             :1;
            __IO  uint32_t  SUBSTEP2             :1;
            __IO  uint32_t  SUBSTEP3             :1;
            __IO  uint32_t  STEP0                :1;
            __IO  uint32_t  STEP1                :1;
            __IO  uint32_t  STEP2                :1;
            __IO  uint32_t  STEP3                :1;
            __IO  uint32_t  REL0                 :1;
            __IO  uint32_t  REL1                 :1;
            __IO  uint32_t  REL2                 :1;
            __IO  uint32_t  REL3                 :1;
        };
    };
} stc_canfd_crel_field_t;

typedef struct stc_canfd_endn_field
{
    union {
        struct {
            __IO  uint32_t  ETV                  :32;
        };
        struct {
            __IO  uint32_t  ETV0                 :1;
            __IO  uint32_t  ETV1                 :1;
            __IO  uint32_t  ETV2                 :1;
            __IO  uint32_t  ETV3                 :1;
            __IO  uint32_t  ETV4                 :1;
            __IO  uint32_t  ETV5                 :1;
            __IO  uint32_t  ETV6                 :1;
            __IO  uint32_t  ETV7                 :1;
            __IO  uint32_t  ETV8                 :1;
            __IO  uint32_t  ETV9                 :1;
            __IO  uint32_t  ETV10                :1;
            __IO  uint32_t  ETV11                :1;
            __IO  uint32_t  ETV12                :1;
            __IO  uint32_t  ETV13                :1;
            __IO  uint32_t  ETV14                :1;
            __IO  uint32_t  ETV15                :1;
            __IO  uint32_t  ETV16                :1;
            __IO  uint32_t  ETV17                :1;
            __IO  uint32_t  ETV18                :1;
            __IO  uint32_t  ETV19                :1;
            __IO  uint32_t  ETV20                :1;
            __IO  uint32_t  ETV21                :1;
            __IO  uint32_t  ETV22                :1;
            __IO  uint32_t  ETV23                :1;
            __IO  uint32_t  ETV24                :1;
            __IO  uint32_t  ETV25                :1;
            __IO  uint32_t  ETV26                :1;
            __IO  uint32_t  ETV27                :1;
            __IO  uint32_t  ETV28                :1;
            __IO  uint32_t  ETV29                :1;
            __IO  uint32_t  ETV30                :1;
            __IO  uint32_t  ETV31                :1;
        };
    };
} stc_canfd_endn_field_t;

