mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/common/s6e2dhxg.h
/*******************************************************************************
* I2SPRE_MODULE
*******************************************************************************/
typedef struct stc_i2spre_iccr_field
{
        __IO  uint32_t  I2SEN                    :1;
        __IO  uint32_t  ICSEL                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_i2spre_iccr_field_t;

typedef struct stc_i2spre_ipcr1_field
{
        __IO  uint32_t  IPLLEN                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2spre_ipcr1_field_t;

typedef struct stc_i2spre_ipcr2_field
{
    union {
        struct {
            __IO  uint32_t  IPOWT                :3;
            __IO  uint32_t  RESERVED0            :29;
        };
        struct {
            __IO  uint32_t  IPOWT0               :1;
            __IO  uint32_t  IPOWT1               :1;
            __IO  uint32_t  IPOWT2               :1;
            __IO  uint32_t  RESERVED1            :29;
        };
    };
} stc_i2spre_ipcr2_field_t;

typedef struct stc_i2spre_ipcr3_field
{
    union {
        struct {
            __IO  uint32_t  IPLLK                :5;
            __IO  uint32_t  RESERVED0            :27;
        };
        struct {
            __IO  uint32_t  IPLLK0               :1;
            __IO  uint32_t  IPLLK1               :1;
            __IO  uint32_t  IPLLK2               :1;
            __IO  uint32_t  IPLLK3               :1;
            __IO  uint32_t  IPLLK4               :1;
            __IO  uint32_t  RESERVED1            :27;
        };
    };
} stc_i2spre_ipcr3_field_t;

typedef struct stc_i2spre_ipcr4_field
{
    union {
        struct {
            __IO  uint32_t  IPLLN                :7;
            __IO  uint32_t  RESERVED0            :25;
        };
        struct {
            __IO  uint32_t  IPLLN0               :1;
            __IO  uint32_t  IPLLN1               :1;
            __IO  uint32_t  IPLLN2               :1;
            __IO  uint32_t  IPLLN3               :1;
            __IO  uint32_t  IPLLN4               :1;
            __IO  uint32_t  IPLLN5               :1;
            __IO  uint32_t  IPLLN6               :1;
            __IO  uint32_t  RESERVED1            :25;
        };
    };
} stc_i2spre_ipcr4_field_t;

typedef struct stc_i2spre_ip_str_field
{
        __IO  uint32_t  IPRDY                    :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2spre_ip_str_field_t;

typedef struct stc_i2spre_ipint_enr_field
{
        __IO  uint32_t  IPCSE                    :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2spre_ipint_enr_field_t;

typedef struct stc_i2spre_ipint_clr_field
{
        __IO  uint32_t  IPCSC                    :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2spre_ipint_clr_field_t;

typedef struct stc_i2spre_ipint_str_field
{
        __IO  uint32_t  IPCSI                    :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2spre_ipint_str_field_t;

typedef struct stc_i2spre_ipcr5_field
{
    union {
        struct {
            __IO  uint32_t  IPLLM                :7;
            __IO  uint32_t  RESERVED0            :25;
        };
        struct {
            __IO  uint32_t  IPLLM0               :1;
            __IO  uint32_t  IPLLM1               :1;
            __IO  uint32_t  IPLLM2               :1;
            __IO  uint32_t  IPLLM3               :1;
            __IO  uint32_t  IPLLM4               :1;
            __IO  uint32_t  IPLLM5               :1;
            __IO  uint32_t  IPLLM6               :1;
            __IO  uint32_t  RESERVED1            :25;
        };
    };
} stc_i2spre_ipcr5_field_t;

typedef struct stc_i2spre_iccr_1_field
{
        __IO  uint32_t  I2SEN1                   :1;
        __IO  uint32_t  ICSEL1                   :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_i2spre_iccr_1_field_t;

typedef struct stc_i2spre_ipcr5_1_field
{
    union {
        struct {
            __IO  uint32_t  IPLLM1               :7;
            __IO  uint32_t  RESERVED0            :25;
        };
        struct {
            __IO  uint32_t  IPLLM10              :1;
            __IO  uint32_t  IPLLM11              :1;
            __IO  uint32_t  IPLLM12              :1;
            __IO  uint32_t  IPLLM13              :1;
            __IO  uint32_t  IPLLM14              :1;
            __IO  uint32_t  IPLLM15              :1;
            __IO  uint32_t  IPLLM16              :1;
            __IO  uint32_t  RESERVED1            :25;
        };
    };
} stc_i2spre_ipcr5_1_field_t;

/*******************************************************************************
* INTREQ_MODULE
*******************************************************************************/
typedef struct stc_intreq_drqsel_field
{
        __IO  uint32_t  USBEP1                   :1;
        __IO  uint32_t  USBEP2                   :1;
        __IO  uint32_t  USBEP3                   :1;
        __IO  uint32_t  USBEP4                   :1;
        __IO  uint32_t  USBEP5                   :1;
        __IO  uint32_t  ADCSCAN0                 :1;
        __IO  uint32_t  ADCSCAN1                 :1;
        __IO  uint32_t  ADCSCAN2                 :1;
        __IO  uint32_t  IRQ0BT0                  :1;
        __IO  uint32_t  IRQ0BT2                  :1;
        __IO  uint32_t  IRQ0BT4                  :1;
        __IO  uint32_t  IRQ0BT6                  :1;
        __IO  uint32_t  MFS0RX                   :1;
        __IO  uint32_t  MFS0TX                   :1;
        __IO  uint32_t  MFS1RX                   :1;
        __IO  uint32_t  MFS1TX                   :1;
        __IO  uint32_t  MFS2RX                   :1;
        __IO  uint32_t  MFS2TX                   :1;
        __IO  uint32_t  MFS3RX                   :1;
        __IO  uint32_t  MFS3TX                   :1;
        __IO  uint32_t  MFS4RX                   :1;
        __IO  uint32_t  MFS4TX                   :1;
        __IO  uint32_t  MFS5RX                   :1;
        __IO  uint32_t  MFS5TX                   :1;
        __IO  uint32_t  MFS6RX                   :1;
        __IO  uint32_t  MFS6TX                   :1;
        __IO  uint32_t  MFS7RX                   :1;
        __IO  uint32_t  MFS7TX                   :1;
        __IO  uint32_t  EXINT0                   :1;
        __IO  uint32_t  EXINT1                   :1;
        __IO  uint32_t  EXINT2                   :1;
        __IO  uint32_t  EXINT3                   :1;
} stc_intreq_drqsel_field_t;

