mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/common/s6e2dhxg.h
/*******************************************************************************
* EXTI Registers EXTI
*   Register Definition
*******************************************************************************/
#define FM_EXTI_ENIR                              *((volatile uint32_t*)(0x40030000UL))
#define FM4_EXTI_ENIR                             *((volatile uint32_t*)(0x40030000UL))
#define FM_EXTI_EIRR                              *((volatile uint32_t*)(0x40030004UL))
#define FM4_EXTI_EIRR                             *((volatile uint32_t*)(0x40030004UL))
#define FM_EXTI_EICL                              *((volatile uint32_t*)(0x40030008UL))
#define FM4_EXTI_EICL                             *((volatile uint32_t*)(0x40030008UL))
#define FM_EXTI_ELVR                              *((volatile uint32_t*)(0x4003000CUL))
#define FM4_EXTI_ELVR                             *((volatile uint32_t*)(0x4003000CUL))
#define FM_EXTI_ELVR1                             *((volatile uint32_t*)(0x40030010UL))
#define FM4_EXTI_ELVR1                            *((volatile uint32_t*)(0x40030010UL))
#define FM_EXTI_NMIRR                             *((volatile uint16_t*)(0x40030014UL))
#define FM4_EXTI_NMIRR                            *((volatile uint16_t*)(0x40030014UL))
#define FM_EXTI_NMICL                             *((volatile uint16_t*)(0x40030018UL))
#define FM4_EXTI_NMICL                            *((volatile uint16_t*)(0x40030018UL))

/*******************************************************************************
* FLASH_IF Registers FLASH_IF
*   Register Definition
*******************************************************************************/
#define FM_FLASH_IF_FASZR                         *((volatile uint32_t*)(0x40000000UL))
#define FM4_FLASH_IF_FASZR                        *((volatile uint32_t*)(0x40000000UL))
#define FM_FLASH_IF_FRWTR                         *((volatile uint32_t*)(0x40000004UL))
#define FM4_FLASH_IF_FRWTR                        *((volatile uint32_t*)(0x40000004UL))
#define FM_FLASH_IF_FSTR                          *((volatile uint32_t*)(0x40000008UL))
#define FM4_FLASH_IF_FSTR                         *((volatile uint32_t*)(0x40000008UL))
#define FM_FLASH_IF_FSYNDN                        *((volatile uint32_t*)(0x40000010UL))
#define FM4_FLASH_IF_FSYNDN                       *((volatile uint32_t*)(0x40000010UL))
#define FM_FLASH_IF_FBFCR                         *((volatile uint32_t*)(0x40000014UL))
#define FM4_FLASH_IF_FBFCR                        *((volatile uint32_t*)(0x40000014UL))
#define FM_FLASH_IF_FICR                          *((volatile uint32_t*)(0x40000020UL))
#define FM4_FLASH_IF_FICR                         *((volatile uint32_t*)(0x40000020UL))
#define FM_FLASH_IF_FISR                          *((volatile uint32_t*)(0x40000024UL))
#define FM4_FLASH_IF_FISR                         *((volatile uint32_t*)(0x40000024UL))
#define FM_FLASH_IF_FICLR                         *((volatile uint32_t*)(0x40000028UL))
#define FM4_FLASH_IF_FICLR                        *((volatile uint32_t*)(0x40000028UL))
#define FM_FLASH_IF_CRTRMM                        *((volatile uint32_t*)(0x40000100UL))
#define FM4_FLASH_IF_CRTRMM                       *((volatile uint32_t*)(0x40000100UL))
#define FM_FLASH_IF_FGPDM1                        *((volatile uint32_t*)(0x40000110UL))
#define FM4_FLASH_IF_FGPDM1                       *((volatile uint32_t*)(0x40000110UL))
#define FM_FLASH_IF_FGPDM2                        *((volatile uint32_t*)(0x40000114UL))
#define FM4_FLASH_IF_FGPDM2                       *((volatile uint32_t*)(0x40000114UL))
#define FM_FLASH_IF_FGPDM3                        *((volatile uint32_t*)(0x40000118UL))
#define FM4_FLASH_IF_FGPDM3                       *((volatile uint32_t*)(0x40000118UL))
#define FM_FLASH_IF_FGPDM4                        *((volatile uint32_t*)(0x4000011CUL))
#define FM4_FLASH_IF_FGPDM4                       *((volatile uint32_t*)(0x4000011CUL))

/*******************************************************************************
* GDCPRE Registers GDCPRE
*   Register Definition
*******************************************************************************/
#define FM_GDCPRE_GCCR                            *((volatile  uint8_t*)(0x4003D100UL))
#define FM4_GDCPRE_GCCR                           *((volatile  uint8_t*)(0x4003D100UL))
#define FM_GDCPRE_GPCR1                           *((volatile  uint8_t*)(0x4003D104UL))
#define FM4_GDCPRE_GPCR1                          *((volatile  uint8_t*)(0x4003D104UL))
#define FM_GDCPRE_GPCR2                           *((volatile  uint8_t*)(0x4003D108UL))
#define FM4_GDCPRE_GPCR2                          *((volatile  uint8_t*)(0x4003D108UL))
#define FM_GDCPRE_GPCR3                           *((volatile  uint8_t*)(0x4003D10CUL))
#define FM4_GDCPRE_GPCR3                          *((volatile  uint8_t*)(0x4003D10CUL))
#define FM_GDCPRE_GPCR4                           *((volatile  uint8_t*)(0x4003D110UL))
#define FM4_GDCPRE_GPCR4                          *((volatile  uint8_t*)(0x4003D110UL))
#define FM_GDCPRE_GP_STR                          *((volatile  uint8_t*)(0x4003D114UL))
#define FM4_GDCPRE_GP_STR                         *((volatile  uint8_t*)(0x4003D114UL))
#define FM_GDCPRE_GPINT_ENR                       *((volatile  uint8_t*)(0x4003D118UL))
#define FM4_GDCPRE_GPINT_ENR                      *((volatile  uint8_t*)(0x4003D118UL))
#define FM_GDCPRE_GPINT_CLR                       *((volatile  uint8_t*)(0x4003D11CUL))
#define FM4_GDCPRE_GPINT_CLR                      *((volatile  uint8_t*)(0x4003D11CUL))
#define FM_GDCPRE_GPINT_STR                       *((volatile  uint8_t*)(0x4003D120UL))
#define FM4_GDCPRE_GPINT_STR                      *((volatile  uint8_t*)(0x4003D120UL))
#define FM_GDCPRE_GCSR                            *((volatile uint16_t*)(0x4003D128UL))
#define FM4_GDCPRE_GCSR                           *((volatile uint16_t*)(0x4003D128UL))
#define FM_GDCPRE_GRCR                            *((volatile  uint8_t*)(0x4003D12CUL))
#define FM4_GDCPRE_GRCR                           *((volatile  uint8_t*)(0x4003D12CUL))
#define FM_GDCPRE_GMCR                            *((volatile  uint8_t*)(0x4003D130UL))
#define FM4_GDCPRE_GMCR                           *((volatile  uint8_t*)(0x4003D130UL))

