mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/common/s6e2dhxg.h
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile  uint8_t *)(0x42DE8224UL))

#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P0                        *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P1                        *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P2                        *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P3                        *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM_GPIO_PDOR5_P4                         *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P4                        *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM_GPIO_PDOR5_P5                         *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P5                        *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM_GPIO_PDOR5_P6                         *((volatile  uint8_t *)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P6                        *((volatile  uint8_t *)(0x42DE8298UL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM_GPIO_PDOR6_P4                         *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P4                        *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM_GPIO_PDOR6_P5                         *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P5                        *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM_GPIO_PDOR6_P6                         *((volatile  uint8_t *)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P6                        *((volatile  uint8_t *)(0x42DE8318UL))
#define bFM_GPIO_PDOR6_P7                         *((volatile  uint8_t *)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P7                        *((volatile  uint8_t *)(0x42DE831CUL))
#define bFM_GPIO_PDOR6_P8                         *((volatile  uint8_t *)(0x42DE8320UL))
#define bFM4_GPIO_PDOR6_P8                        *((volatile  uint8_t *)(0x42DE8320UL))

#define bFM_GPIO_PDOR7_P0                         *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P0                        *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM_GPIO_PDOR7_P1                         *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P1                        *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM_GPIO_PDOR7_P2                         *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P2                        *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM_GPIO_PDOR7_P3                         *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P3                        *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM_GPIO_PDOR7_P4                         *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P4                        *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM_GPIO_PDOR7_P5                         *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM4_GPIO_PDOR7_P5                        *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM_GPIO_PDOR7_P6                         *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM4_GPIO_PDOR7_P6                        *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM_GPIO_PDOR7_P7                         *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM4_GPIO_PDOR7_P7                        *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM_GPIO_PDOR7_P8                         *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM4_GPIO_PDOR7_P8                        *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM_GPIO_PDOR7_P9                         *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM4_GPIO_PDOR7_P9                        *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM_GPIO_PDOR7_PA                         *((volatile  uint8_t *)(0x42DE83A8UL))
#define bFM4_GPIO_PDOR7_PA                        *((volatile  uint8_t *)(0x42DE83A8UL))
#define bFM_GPIO_PDOR7_PB                         *((volatile  uint8_t *)(0x42DE83ACUL))
#define bFM4_GPIO_PDOR7_PB                        *((volatile  uint8_t *)(0x42DE83ACUL))
#define bFM_GPIO_PDOR7_PC                         *((volatile  uint8_t *)(0x42DE83B0UL))
#define bFM4_GPIO_PDOR7_PC                        *((volatile  uint8_t *)(0x42DE83B0UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))

#define bFM_GPIO_PDOR9_P0                         *((volatile  uint8_t *)(0x42DE8480UL))
#define bFM4_GPIO_PDOR9_P0                        *((volatile  uint8_t *)(0x42DE8480UL))
#define bFM_GPIO_PDOR9_P1                         *((volatile  uint8_t *)(0x42DE8484UL))
#define bFM4_GPIO_PDOR9_P1                        *((volatile  uint8_t *)(0x42DE8484UL))
#define bFM_GPIO_PDOR9_P2                         *((volatile  uint8_t *)(0x42DE8488UL))
#define bFM4_GPIO_PDOR9_P2                        *((volatile  uint8_t *)(0x42DE8488UL))
#define bFM_GPIO_PDOR9_P3                         *((volatile  uint8_t *)(0x42DE848CUL))
#define bFM4_GPIO_PDOR9_P3                        *((volatile  uint8_t *)(0x42DE848CUL))
#define bFM_GPIO_PDOR9_P4                         *((volatile  uint8_t *)(0x42DE8490UL))
#define bFM4_GPIO_PDOR9_P4                        *((volatile  uint8_t *)(0x42DE8490UL))
#define bFM_GPIO_PDOR9_P5                         *((volatile  uint8_t *)(0x42DE8494UL))
#define bFM4_GPIO_PDOR9_P5                        *((volatile  uint8_t *)(0x42DE8494UL))
#define bFM_GPIO_PDOR9_P6                         *((volatile  uint8_t *)(0x42DE8498UL))
#define bFM4_GPIO_PDOR9_P6                        *((volatile  uint8_t *)(0x42DE8498UL))
#define bFM_GPIO_PDOR9_P7                         *((volatile  uint8_t *)(0x42DE849CUL))
#define bFM4_GPIO_PDOR9_P7                        *((volatile  uint8_t *)(0x42DE849CUL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

