mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxg/common/s6e2dhxg.h
#define bFM_INTREQ_IRQ010SEL_SELBIT0              *((volatile  uint8_t *)(0x426225C0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT0             *((volatile  uint8_t *)(0x426225C0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT1              *((volatile  uint8_t *)(0x426225C4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT1             *((volatile  uint8_t *)(0x426225C4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT2              *((volatile  uint8_t *)(0x426225C8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT2             *((volatile  uint8_t *)(0x426225C8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT3              *((volatile  uint8_t *)(0x426225CCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT3             *((volatile  uint8_t *)(0x426225CCUL))
#define bFM_INTREQ_IRQ010SEL_SELBIT4              *((volatile  uint8_t *)(0x426225D0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT4             *((volatile  uint8_t *)(0x426225D0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT5              *((volatile  uint8_t *)(0x426225D4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT5             *((volatile  uint8_t *)(0x426225D4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT6              *((volatile  uint8_t *)(0x426225D8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT6             *((volatile  uint8_t *)(0x426225D8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT7              *((volatile  uint8_t *)(0x426225DCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT7             *((volatile  uint8_t *)(0x426225DCUL))
#define bFM_INTREQ_IRQ010SEL_SELBIT8              *((volatile  uint8_t *)(0x426225E0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT8             *((volatile  uint8_t *)(0x426225E0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT9              *((volatile  uint8_t *)(0x426225E4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT9             *((volatile  uint8_t *)(0x426225E4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT10             *((volatile  uint8_t *)(0x426225E8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT10            *((volatile  uint8_t *)(0x426225E8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT11             *((volatile  uint8_t *)(0x426225ECUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT11            *((volatile  uint8_t *)(0x426225ECUL))
#define bFM_INTREQ_IRQ010SEL_SELBIT12             *((volatile  uint8_t *)(0x426225F0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT12            *((volatile  uint8_t *)(0x426225F0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT13             *((volatile  uint8_t *)(0x426225F4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT13            *((volatile  uint8_t *)(0x426225F4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT14             *((volatile  uint8_t *)(0x426225F8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT14            *((volatile  uint8_t *)(0x426225F8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT15             *((volatile  uint8_t *)(0x426225FCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT15            *((volatile  uint8_t *)(0x426225FCUL))

#define bFM_INTREQ_IRQ011MON_EXTINT               *((volatile  uint8_t *)(0x42624600UL))
#define bFM4_INTREQ_IRQ011MON_EXTINT              *((volatile  uint8_t *)(0x42624600UL))

#define bFM_INTREQ_IRQ012MON_EXTINT               *((volatile  uint8_t *)(0x42624680UL))
#define bFM4_INTREQ_IRQ012MON_EXTINT              *((volatile  uint8_t *)(0x42624680UL))

#define bFM_INTREQ_IRQ013MON_EXTINT               *((volatile  uint8_t *)(0x42624700UL))
#define bFM4_INTREQ_IRQ013MON_EXTINT              *((volatile  uint8_t *)(0x42624700UL))

#define bFM_INTREQ_IRQ014MON_EXTINT               *((volatile  uint8_t *)(0x42624780UL))
#define bFM4_INTREQ_IRQ014MON_EXTINT              *((volatile  uint8_t *)(0x42624780UL))

#define bFM_INTREQ_IRQ015MON_EXTINT               *((volatile  uint8_t *)(0x42624800UL))
#define bFM4_INTREQ_IRQ015MON_EXTINT              *((volatile  uint8_t *)(0x42624800UL))

#define bFM_INTREQ_IRQ016MON_EXTINT               *((volatile  uint8_t *)(0x42624880UL))
#define bFM4_INTREQ_IRQ016MON_EXTINT              *((volatile  uint8_t *)(0x42624880UL))

#define bFM_INTREQ_IRQ017MON_EXTINT               *((volatile  uint8_t *)(0x42624900UL))
#define bFM4_INTREQ_IRQ017MON_EXTINT              *((volatile  uint8_t *)(0x42624900UL))

#define bFM_INTREQ_IRQ018MON_EXTINT               *((volatile  uint8_t *)(0x42624980UL))
#define bFM4_INTREQ_IRQ018MON_EXTINT              *((volatile  uint8_t *)(0x42624980UL))

#define bFM_INTREQ_IRQ019MON_QPRCINT0             *((volatile  uint8_t *)(0x42624A00UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT0            *((volatile  uint8_t *)(0x42624A00UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT1             *((volatile  uint8_t *)(0x42624A04UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT1            *((volatile  uint8_t *)(0x42624A04UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT2             *((volatile  uint8_t *)(0x42624A08UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT2            *((volatile  uint8_t *)(0x42624A08UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT3             *((volatile  uint8_t *)(0x42624A0CUL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT3            *((volatile  uint8_t *)(0x42624A0CUL))
#define bFM_INTREQ_IRQ019MON_QPRCINT4             *((volatile  uint8_t *)(0x42624A10UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT4            *((volatile  uint8_t *)(0x42624A10UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT5             *((volatile  uint8_t *)(0x42624A14UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT5            *((volatile  uint8_t *)(0x42624A14UL))

#define bFM_INTREQ_IRQ020MON_QPRCINT0             *((volatile  uint8_t *)(0x42624A80UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT0            *((volatile  uint8_t *)(0x42624A80UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT1             *((volatile  uint8_t *)(0x42624A84UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT1            *((volatile  uint8_t *)(0x42624A84UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT2             *((volatile  uint8_t *)(0x42624A88UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT2            *((volatile  uint8_t *)(0x42624A88UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT3             *((volatile  uint8_t *)(0x42624A8CUL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT3            *((volatile  uint8_t *)(0x42624A8CUL))
#define bFM_INTREQ_IRQ020MON_QPRCINT4             *((volatile  uint8_t *)(0x42624A90UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT4            *((volatile  uint8_t *)(0x42624A90UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT5             *((volatile  uint8_t *)(0x42624A94UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT5            *((volatile  uint8_t *)(0x42624A94UL))

#define bFM_INTREQ_IRQ021MON_WAVEINT0             *((volatile  uint8_t *)(0x42624B00UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT0            *((volatile  uint8_t *)(0x42624B00UL))
#define bFM_INTREQ_IRQ021MON_WAVEINT1             *((volatile  uint8_t *)(0x42624B04UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT1            *((volatile  uint8_t *)(0x42624B04UL))
#define bFM_INTREQ_IRQ021MON_WAVEINT2             *((volatile  uint8_t *)(0x42624B08UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT2            *((volatile  uint8_t *)(0x42624B08UL))
#define bFM_INTREQ_IRQ021MON_WAVEINT3             *((volatile  uint8_t *)(0x42624B0CUL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT3            *((volatile  uint8_t *)(0x42624B0CUL))

#define bFM_INTREQ_IRQ022MON_WAVEINT0             *((volatile  uint8_t *)(0x42624B80UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT0            *((volatile  uint8_t *)(0x42624B80UL))
#define bFM_INTREQ_IRQ022MON_WAVEINT1             *((volatile  uint8_t *)(0x42624B84UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT1            *((volatile  uint8_t *)(0x42624B84UL))
#define bFM_INTREQ_IRQ022MON_WAVEINT2             *((volatile  uint8_t *)(0x42624B88UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT2            *((volatile  uint8_t *)(0x42624B88UL))
#define bFM_INTREQ_IRQ022MON_WAVEINT3             *((volatile  uint8_t *)(0x42624B8CUL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT3            *((volatile  uint8_t *)(0x42624B8CUL))

#define bFM_INTREQ_IRQ023MON_WAVEINT0             *((volatile  uint8_t *)(0x42624C00UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT0            *((volatile  uint8_t *)(0x42624C00UL))
#define bFM_INTREQ_IRQ023MON_WAVEINT1             *((volatile  uint8_t *)(0x42624C04UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT1            *((volatile  uint8_t *)(0x42624C04UL))
#define bFM_INTREQ_IRQ023MON_WAVEINT2             *((volatile  uint8_t *)(0x42624C08UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT2            *((volatile  uint8_t *)(0x42624C08UL))
#define bFM_INTREQ_IRQ023MON_WAVEINT3             *((volatile  uint8_t *)(0x42624C0CUL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT3            *((volatile  uint8_t *)(0x42624C0CUL))

#define bFM_INTREQ_IRQ024MON_FRT_PEAK_INT0        *((volatile  uint8_t *)(0x42624C80UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT0       *((volatile  uint8_t *)(0x42624C80UL))
#define bFM_INTREQ_IRQ024MON_FRT_PEAK_INT1        *((volatile  uint8_t *)(0x42624C84UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT1       *((volatile  uint8_t *)(0x42624C84UL))
#define bFM_INTREQ_IRQ024MON_FRT_PEAK_INT2        *((volatile  uint8_t *)(0x42624C88UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT2       *((volatile  uint8_t *)(0x42624C88UL))

#define bFM_INTREQ_IRQ025MON_FRT_ZERO_INT0        *((volatile  uint8_t *)(0x42624D00UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT0       *((volatile  uint8_t *)(0x42624D00UL))
#define bFM_INTREQ_IRQ025MON_FRT_ZERO_INT1        *((volatile  uint8_t *)(0x42624D04UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT1       *((volatile  uint8_t *)(0x42624D04UL))
#define bFM_INTREQ_IRQ025MON_FRT_ZERO_INT2        *((volatile  uint8_t *)(0x42624D08UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT2       *((volatile  uint8_t *)(0x42624D08UL))

#define bFM_INTREQ_IRQ026MON_ICUINT0              *((volatile  uint8_t *)(0x42624D80UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT0             *((volatile  uint8_t *)(0x42624D80UL))
#define bFM_INTREQ_IRQ026MON_ICUINT1              *((volatile  uint8_t *)(0x42624D84UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT1             *((volatile  uint8_t *)(0x42624D84UL))
#define bFM_INTREQ_IRQ026MON_ICUINT2              *((volatile  uint8_t *)(0x42624D88UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT2             *((volatile  uint8_t *)(0x42624D88UL))
#define bFM_INTREQ_IRQ026MON_ICUINT3              *((volatile  uint8_t *)(0x42624D8CUL))
#define bFM4_INTREQ_IRQ026MON_ICUINT3             *((volatile  uint8_t *)(0x42624D8CUL))

